zhouxw0928/STM32/STM32project/8-2 DMA+AD多通道/Hardware/AD.c
#include "stm32f10x.h"                  // Device header


uint16_t AD_Value[4];

void AD_Init(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
    
    RCC_ADCCLKConfig(RCC_PCLK2_Div6);
    
    GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

    ADC_RegularChannelConfig(ADC1, ADC_Channel_0, 1,ADC_SampleTime_55Cycles5);  // 通道0放在序列1的位置
    ADC_RegularChannelConfig(ADC1, ADC_Channel_1, 2,ADC_SampleTime_55Cycles5);
    ADC_RegularChannelConfig(ADC1, ADC_Channel_2, 3,ADC_SampleTime_55Cycles5);  
    ADC_RegularChannelConfig(ADC1, ADC_Channel_3, 4,ADC_SampleTime_55Cycles5);  
    
    ADC_InitTypeDef ADC_InitStructure;
    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None; // 软件触发
    ADC_InitStructure.ADC_ContinuousConvMode = ENABLE; // DISABLE单次扫描 ENABLE连续扫描
    ADC_InitStructure.ADC_ScanConvMode = ENABLE;    // 开启扫描模式
    ADC_InitStructure.ADC_NbrOfChannel = 4;         // 一共有4个序列
    ADC_Init(ADC1, &ADC_InitStructure);

    DMA_InitTypeDef DMA_InitStructure;
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&ADC1->DR;        // 外设起始地址
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;        // 外设数据宽度
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;             // 外设地址不自增
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)AD_Value;            // 存储器起始地址
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;            // 存储器数据宽度
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable; // 存储器地址自增
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;      // 传输方向
    DMA_InitStructure.DMA_BufferSize = 4;                // 传输计数器大小
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;           // 是否启用自动重装器
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;             // 触发方式
    DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;   // 优先级
    DMA_Init(DMA1_Channel1, &DMA_InitStructure);

    DMA_Cmd(DMA1_Channel1, ENABLE);
    ADC_DMACmd(ADC1, ENABLE);
    ADC_Cmd(ADC1, ENABLE);
    
    ADC_ResetCalibration(ADC1);     // 标志位 置1开始复位校准
    while (ADC_GetResetCalibrationStatus(ADC1) == SET); // 变为0，复位校准结束
    ADC_StartCalibration(ADC1);
    while (ADC_GetCalibrationStatus(ADC1) == SET);
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);
}

// void AD_GetValue(void)   // 指定通道，返回该通道的值
// { 
//     DMA_Cmd(DMA1_Channel1, DISABLE);
//     DMA_SetCurrDataCounter(DMA1_Channel1, 4);
//     DMA_Cmd(DMA1_Channel1, ENABLE);

//     while(DMA_GetFlagStatus(DMA1_FLAG_TC1) == RESET);   // 转运完成标志位置1
//     DMA_ClearFlag(DMA1_FLAG_TC1);   // 转运结束 清楚标志位
// }
